import React, {Component} from 'react';

export default class  UserAgreePage extends Component{
    render() {
        return (
            <div className="userAgreePage" style={{marginTop: '0.76rem', background: '#fff', padding: '0.24rem'}}>
                <h3 className="userAgree">用户协议</h3>
                <p>请仔细阅读以下条款，本协议是由您（以下称“用户”）与杭州哲信信息技术有限公司（以下称“杭州哲信”）就其提供的“会说话的汤姆猫商城”互联网服务（包括但不限于：会说话的汤姆猫商城网站（shop.talkingtomandfriends.com）等）所订立的相关权利义务规范。本服务条款对您和“杭州哲信“均具有法律效力。本协议连同所有更新材料，补充条款以及“杭州哲信”的一切规则和政策共同构成了您与“杭州哲信”之间的协议。</p>
                <p>本协议的服务条款可由“杭州哲信”在必要时进行更新。服务条款一旦发生变更，“杭州哲信”将在网页上或App端公布所修改的内容。修改后的服务条款一经公布即有效替代原服务条款。您可随时登陆“会说话的汤姆猫商城”网站查阅最新版服务条款。如果用户对本协议修改后的任何条款表示异议，用户可以主动取消或不再使用“会说话的汤姆猫商城”服务；如果用户继续选择使用“会说话的汤姆猫商城”服务，则视为用户已经完全接受本协议及其修改。</p>
                <p className="p1">一．服务内容</p>
                <p>会说话的汤姆猫商城的具体服务内容由会说话的汤姆猫商城根据当下的实际情况提供。会说话的汤姆猫商城保留变更、中断或终止部分网络服务的权利。会说话的汤姆猫商城保留根据实际情况随时调整会说话的汤姆猫商城提供的服务种类及形式。会说话的汤姆猫商城不承担因业务调整给用户造成的损失。</p>
                <p>用户理解，会说话的汤姆猫商城仅提供服务相关的技术服务等，除此之外与网络服务相关的设备（如个人电脑、手机及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费，为使用移动网而支付的手机费）均应由用户自行负担。</p>
                <p className="p1">二．内容使用和知识产权</p>
                <p>我们鼓励用户充分利用会说话的汤姆猫商城网站自由地张贴和共享他们自己的信息，但需以会说话的汤姆猫商城社区指导条款为原则。用户对经由会说话的汤姆猫商城平台上载、张贴或传送的内容承担全部责任。未经版权人许可，用户不得在会说话的汤姆猫商城网站上张贴任何受版权保护的内容。用户对于其创作并在会说话的汤姆猫商城上发布的合法内容依法享有著作权及其相关权利。</p>
                <p>用户通过会说话的汤姆猫商城上传任何内容到会说话的汤姆猫商城网站之行为，即构成用户将其上传到会说话的汤姆猫商城网站的全部/任何内容授权会说话的汤姆猫商城在全世界范围内具有免费的、永久的、不可撤销的、非独家的许可以及再许可的权利，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。任何其他用户或网站需要转载该作品的，必须征得原文作者授权。会说话的汤姆猫商城制作、发布、传播的信息内容的版权归会说话的汤姆猫商城所有，非经会说话的汤姆猫商城许可，任何用户或者第三方不得复制、修改或者转载该内容，或者将其用于任何商业目的。</p>
                <p className="p1">三．注册信息</p>
                <p>会说话的汤姆猫商城为用户提供对个人注册信息的绝对的控制权，用户可以通过个人资料页面查看或修改个人信息。用户自愿注册个人信息，用户在注册时提供的所有信息，都是基于自愿，用户有权在任何时候拒绝提供这些信息。</p>
                <p>用户在申请使用会说话的汤姆猫商城服务时，必须提供真实的个人资料，并不断更新注册资料。如果因注册信息不真实而引起的问题及其后果，会说话的汤姆猫商城不承担任何责任。
                    用户不得将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即与会说话的汤姆猫商城客服人员联系以降低损失。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，会说话的汤姆猫商城不承担任何责任。
                </p>
                <p className="p1">四．隐私保护权</p>
                <p>会说话的汤姆猫商城隐私保护政策属于会说话的汤姆猫商城服务协议不可分割的一部分。您在同意会说话的汤姆猫商城服务协议之时，即视为您已经同意隐私保护政策全部内容。我们非常重视您的隐私，保护用户隐私是会说话的汤姆猫商城的重点原则，在您使用会说话的汤姆猫商城提供的服务前，请您仔细阅读会说话的汤姆猫商城隐私保护政策。</p>
                <p className="p1">五．免责声明</p>
                <p>互联网是一个开放平台，用户将照片等个人资料上传到互联网上，有可能会被其他组织或个人复制、转载、擅改或做其它非法用途，用户必须充分意识此类风险的存在。用户明确同意其使用会说话的汤姆猫商城的服务所存在的风险将完全由其自己承担；因其使用会说话的汤姆猫商城的服务而产生的一切后果也由其自己承担，我们对用户不承担任何责任。我们不保证服务一定能满足用户的要求，也不保证服务不会中断，对服务的及时性、安全性、准确性也都不作保证。对于因不可抗力或会说话的汤姆猫商城无法控制的原因造成的网络服务中断或其他缺陷，会说话的汤姆猫商城不承担任何责任。我们不对用户所发布信息的删除或储存失败承担责任。我们有权判断用户的行为是否符合本网站的服务协议之规定，如果我们认为用户违背了本网站服务协议的规定，我们有终止向其提供服务的权利。</p>
                <p className="p1">六．服务变更、中断或终止</p>
                <p>如因系统维护或升级的需要而需暂停服务，会说话的汤姆猫商城将尽可能事先在网站上进行通告。如发生下列任何一种情形，会说话的汤姆猫商城有权单方面中断或终止向用户提供服务而无需通知用户：
                    ◇用户提供的个人资料不真实；
                    ◇用户违反了本服务协议中的一项或多项条款；
                    ◇未经会说话的汤姆猫商城同意，将会说话的汤姆猫商城网站或者会说话的汤姆猫商城制作、发布、传播的任何信息内容用于商业目的。
                </p>
                <p className="p1">七．服务条款的完善和修改</p>
                <p>会说话的汤姆猫商城会有权根据互联网的发展和中华人民共和国有关法律、法规的变化，不时地完善和修改会说话的汤姆猫商城服务条款。会说话的汤姆猫商城保留随时修改服务条款的权利，用户在使用会说话的汤姆猫商城平台服务时，有必要对最新的会说话的汤姆猫商城服务条款进行仔细阅读和重新确认，用户对会说话的汤姆猫商城服务平台服务的使用即构成同意并接受完善和修改后的最新良舱服务条款，当发生有关争议时，以最新的服务条款为准。</p>
                <p className="p1">八．通知送达</p>
                <p>本协议项下会说话的汤姆猫商城对于用户所有的通知均可通过网页公告、电子邮件、系统通知、会说话的汤姆猫商城管理账号主动联系、私信、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。用户对于会说话的汤姆猫商城的通知应当通过会说话的汤姆猫商城对外正式公布的通信地址、服务电话、传真号码、电子邮件地址等联系信息进行送达。</p>
                <p className="p1">九．其他</p>
                <p>本用户条款的订立、执行和解释及争议的解决均应适用中华人民共和国法律。如用户就本协议内容或其执行发生任何争议，用户应尽量与我们友好协商解决；协商不成时，任何一方均可向会说话的汤姆猫商城所在地的人民法院提起诉讼。我们未行使或执行本服务协议任何权利或规定，不构成对前述权利或权利之放弃。如本服务协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本用户条款的其余条款仍应有效并且有约束力。</p>
                <style jsx global>{`
                    .userAgree{
                        text-align: center;
                        height: 1rem;
                        line-height: 1rem;
                        border-bottom: 1px solid #ddd;
                        margin-bottom: 0.12rem;
                    }
                    .userAgreePage p{
                        text-indent: 0.48rem;
                        font-size: 0.24rem;
                        line-height: 0.36rem;
                        font-weight: 300;
                        margin: 0.2rem;
                        break-word: normal;
                    }
                    .userAgreePage .p1{
                        margin: 0.2rem 0;
                        font-size: 0.28rem;
                    }
                  `}</style>
            </div>
        )
    }
}
